In [174]:
import numpy as np
import pandas as pd

In [175]:
df = pd.read_csv('marketing_campaign.csv', sep='\t')

### Первичный просмотр и удаление дубликатов

In [176]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14240 entries, 0 to 14239
Data columns (total 29 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   14240 non-null  int64
 1   Year_Birth           14240 non-null  int64
 2   Education            14240 non-null  object
 3   Marital_Status       14240 non-null  object
 4   Income               14061 non-null  float64
 5   Kidhome              14240 non-null  int64
 6   Teenhome             14240 non-null  int64
 7   Dt_Customer          14240 non-null  object
 8   Recency              14240 non-null  int64
 9   MntWines             13006 non-null  float64
 10  MntFruits            13006 non-null  float64
 11  MntMeatProducts      14240 non-null  int64
 12  MntFishProducts      14240 non-null  int64
 13  MntSweetProducts     14240 non-null  int64
 14  MntGoldProds         14240 non-null  int64
 15  NumDealsPurchases    14240 non-null  int64
 16  NumWebPurchases      14240 non-null  int64
 17  NumCatalogPurchases  14240 non-null  int64
 18  NumStorePurchases    14240 non-null  int64
 19  NumWebVisitsMonth    14240 non-null  int64
 20  AcceptedCmp3         14240 non-null  int64
 21  AcceptedCmp4         14240 non-null  int64
 22  AcceptedCmp5         14240 non-null  int64
 23  AcceptedCmp1         14240 non-null  int64
 24  AcceptedCmp2         14240 non-null  int64
 25  Complain             14240 non-null  int64
 26  Z_CostContact        14240 non-null  int64
 27  Z_Revenue            14240 non-null  int64
 28  Response             14240 non-null  int64
dtypes: float64(3), int64(23), object(3)
memory usage: 3.2+ MB

In [177]:
df[['Z_CostContact', 'Z_Revenue']].value_counts() # ненужные колонки

Z_CostContact  Z_Revenue
3              11           14240
dtype: int64

In [178]:
df = df.drop(columns=['Z_CostContact', 'Z_Revenue'])

Ввёдём новую числовую колонку, соответствующую году Dt_Customer

In [179]:
df['Dt_year_Customer'] = pd.to_datetime(df['Dt_Customer']).dt.year

In [193]:
cat_cols = ['Education', 'Marital_Status', 'Complain', 'Response', *[x for x in df.columns if x.startswith('Acc')]]
num_cols = ['Year_Birth', 'Income', 'Kidhome', 'Teenhome', 'Recency', 'Dt_year_Customer', *[x for x in df.columns if x.startswith('Mnt') or x.startswith('Num')]]

In [181]:
df.drop_duplicates(inplace=True)

In [182]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4157 entries, 0 to 14238
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   4157 non-null   int64
 1   Year_Birth           4157 non-null   int64
 2   Education            4157 non-null   object
 3   Marital_Status       4157 non-null   object
 4   Income               4108 non-null   float64
 5   Kidhome              4157 non-null   int64
 6   Teenhome             4157 non-null   int64
 7   Dt_Customer          4157 non-null   object
 8   Recency              4157 non-null   int64
 9   MntWines             3133 non-null   float64
 10  MntFruits            3154 non-null   float64
 11  MntMeatProducts      4157 non-null   int64
 12  MntFishProducts      4157 non-null   int64
 13  MntSweetProducts     4157 non-null   int64
 14  MntGoldProds         4157 non-null   int64
 15  NumDealsPurchases    4157 non-null   int64
 16  NumWebPurchases      4157 non-null   int64
 17  NumCatalogPurchases  4157 non-null   int64
 18  NumStorePurchases    4157 non-null   int64
 19  NumWebVisitsMonth    4157 non-null   int64
 20  AcceptedCmp3         4157 non-null   int64
 21  AcceptedCmp4         4157 non-null   int64
 22  AcceptedCmp5         4157 non-null   int64
 23  AcceptedCmp1         4157 non-null   int64
 24  AcceptedCmp2         4157 non-null   int64
 25  Complain             4157 non-null   int64
 26  Response             4157 non-null   int64
 27  Dt_year_Customer     4157 non-null   int64
dtypes: float64(3), int64(22), object(3)
memory usage: 941.8+ KB

In [183]:
df_id = df['ID'].value_counts()
id_susp = df_id[df_id > 1].index.values
df.loc[df['ID'].isin(id_susp)].sort_values(by='ID')

,ID,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntWines,...,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,AcceptedCmp2,Complain,Response,Dt_year_Customer
214,0,1985,Graduation,Married,70951.0,0,0,04-05-2013,66,239.0,...,9,1,0,0,0,0,0,0,0,2013
2309,0,1985,Graduation,Married,70951.0,0,0,04-05-2013,66,239.0,...,9,1,0,0,0,0,0,0,0,2013
822,1,1961,Graduation,Single,57091.0,0,0,15-06-2014,0,464.0,...,7,5,0,0,0,0,1,0,1,2014
8609,1,1961,Graduation,Single,57091.0,0,0,15-06-2014,0,NaN,...,7,5,0,0,0,0,1,0,1,2014
3181,13,1947,PhD,Widow,25358.0,0,1,22-07-2013,57,NaN,...,3,6,0,0,0,0,0,0,0,2013
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2183,11187,1978,Basic,Single,26487.0,1,0,20-05-2013,23,2.0,...,3,5,0,0,0,0,0,0,0,2013
12522,11188,1957,Graduation,Together,26091.0,1,1,25-02-2014,84,15.0,...,3,5,0,0,0,0,0,0,0,2014
997,11188,1957,Graduation,Together,26091.0,1,1,25-02-2014,84,15.0,...,3,5,0,0,0,0,0,0,0,2014
6649,11191,1986,Graduation,Divorced,41411.0,0,0,07-12-2013,11,NaN,...,4,6,0,0,0,0,0,0,0,2013
341,11191,1986,Graduation,Divorced,41411.0,0,0,07-12-2013,11,37.0,...,4,6,0,0,0,0,0,0,0,2013

Видно, что есть дубликаты, но в них пропущены значения, поэтому пандас их не праспознаёт

In [184]:
len(df['ID'].value_counts()) # имеем 2240 уникальных ID, столько строк и должно остаться

2240

In [185]:
len(df.loc[df['ID'].isin(id_susp)].sort_values(by='ID').dropna(how='any'))

1450

Не все строки, содержащие Nan имеют являются дубликатами, значит заполним Nanы там, где можем, а потом удалим дубликаты опять

In [186]:
%%time
from tqdm import tqdm
for col in tqdm(['Income', 'MntWines', 'MntFruits']):
    df[col] = df[['ID', col]].groupby('ID').transform(lambda x: x.fillna(x.median()))

100%|████████████████████████████████████████████████████████████████████████████████████| 3/3 [00:11<00:00,  3.86s/it]

Wall time: 11.6 s

In [187]:
df.drop_duplicates(inplace=True)

In [188]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2216 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2237 non-null   float64
 10  MntFruits            2239 non-null   float64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Response             2240 non-null   int64
 27  Dt_year_Customer     2240 non-null   int64
dtypes: float64(3), int64(22), object(3)
memory usage: 507.5+ KB

Осталось очень мало пропусков

### Заполним пропуски

    Для денег на вино сгруппируем по количеству детей и статусу Marital_Status    
    Для фруктов дополним образованием (предположим, образованные знают о пользе фруктов больше) и Teenhome
    Для дохода оставим только образование

In [189]:
df['MntWines'] = df[['Marital_Status', 'MntWines', 'Kidhome']].groupby(['Marital_Status', 'Kidhome']).transform(lambda x: x.fillna(x.median()))
df['MntFruits'] = df[['Education', 'MntFruits', 'Kidhome', 'Teenhome']].groupby(['Education', 'Kidhome', 'Teenhome']).transform(lambda x: x.fillna(x.median()))
df['Income'] = df[['Education', 'Income']].groupby('Education').transform(lambda x: x.fillna(x.median()))

In [190]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 28 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Education            2240 non-null   object
 3   Marital_Status       2240 non-null   object
 4   Income               2240 non-null   float64
 5   Kidhome              2240 non-null   int64
 6   Teenhome             2240 non-null   int64
 7   Dt_Customer          2240 non-null   object
 8   Recency              2240 non-null   int64
 9   MntWines             2240 non-null   float64
 10  MntFruits            2240 non-null   float64
 11  MntMeatProducts      2240 non-null   int64
 12  MntFishProducts      2240 non-null   int64
 13  MntSweetProducts     2240 non-null   int64
 14  MntGoldProds         2240 non-null   int64
 15  NumDealsPurchases    2240 non-null   int64
 16  NumWebPurchases      2240 non-null   int64
 17  NumCatalogPurchases  2240 non-null   int64
 18  NumStorePurchases    2240 non-null   int64
 19  NumWebVisitsMonth    2240 non-null   int64
 20  AcceptedCmp3         2240 non-null   int64
 21  AcceptedCmp4         2240 non-null   int64
 22  AcceptedCmp5         2240 non-null   int64
 23  AcceptedCmp1         2240 non-null   int64
 24  AcceptedCmp2         2240 non-null   int64
 25  Complain             2240 non-null   int64
 26  Response             2240 non-null   int64
 27  Dt_year_Customer     2240 non-null   int64
dtypes: float64(3), int64(22), object(3)
memory usage: 507.5+ KB

### Поработаем с категориальными фичами

In [132]:
df['Marital_Status'].value_counts()

Married     864
Together    580
Single      480
Divorced    232
Widow        77
Alone         3
YOLO          2
Absurd        2
Name: Marital_Status, dtype: int64

In [200]:
comment_dict = {'Education': 'Превосходство класса Graduation, возможно есть смысл обучить несколько моделей',
 'Marital_Status': 'Есть непонятные классы Absurd и YOLOб кроме этого надо объединить Alone и Single и, возможно, Married и Together (в этом случае тоже понадобится несколько моделей). Человек со статусом YOLO может быть рисковым клиентом для банка, это можно учесть при построении моделей, избавляться от этого не будем. Также, про together, YOLO и Absurd необходимо узнать у тех, кто дал эти данные',
 'Complain': 'Явный и вполне очевидный дисбаланс (люди редко жалуются), оставляем как есть',
 'AcceptedCmp3': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть',
 'AcceptedCmp4': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть',
 'AcceptedCmp5': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть',
 'AcceptedCmp1': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть',
 'AcceptedCmp2': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть',
 'Response': 'Явный и вполне очевидный дисбаланс (меньшая часть людей принимает новые условия), оставляем как есть'}

# создан следующим кодом для удобства

# comment_dict = {}
# for cat in cat_cols:
#     print(df[cat].value_counts())
#     comment_dict[cat] = input()
#     print()

Колонки Accepted и Complain (несмотря на дисбаланс) можем оставить как есть, они готовы к использованию в модели
Для Object колонок Marital_Status и Education используем one-hot

In [209]:
df.loc[df['Marital_Status'] == 'Alone', 'Marital_Status']  = 'Single'

In [219]:
ohe_cols = pd.get_dummies(df.Education, prefix='Edu')
df = df.join(ohe_cols).drop(columns = 'Education')
ohe_cols = pd.get_dummies(df.Marital_Status, prefix='Marital')
df = df.join(ohe_cols).drop(columns = 'Marital_Status')

In [221]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2240 entries, 0 to 2239
Data columns (total 38 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   2240 non-null   int64
 1   Year_Birth           2240 non-null   int64
 2   Income               2240 non-null   float64
 3   Kidhome              2240 non-null   int64
 4   Teenhome             2240 non-null   int64
 5   Dt_Customer          2240 non-null   object
 6   Recency              2240 non-null   int64
 7   MntWines             2240 non-null   float64
 8   MntFruits            2240 non-null   float64
 9   MntMeatProducts      2240 non-null   int64
 10  MntFishProducts      2240 non-null   int64
 11  MntSweetProducts     2240 non-null   int64
 12  MntGoldProds         2240 non-null   int64
 13  NumDealsPurchases    2240 non-null   int64
 14  NumWebPurchases      2240 non-null   int64
 15  NumCatalogPurchases  2240 non-null   int64
 16  NumStorePurchases    2240 non-null   int64
 17  NumWebVisitsMonth    2240 non-null   int64
 18  AcceptedCmp3         2240 non-null   int64
 19  AcceptedCmp4         2240 non-null   int64
 20  AcceptedCmp5         2240 non-null   int64
 21  AcceptedCmp1         2240 non-null   int64
 22  AcceptedCmp2         2240 non-null   int64
 23  Complain             2240 non-null   int64
 24  Response             2240 non-null   int64
 25  Dt_year_Customer     2240 non-null   int64
 26  Edu_2n Cycle         2240 non-null   uint8
 27  Edu_Basic            2240 non-null   uint8
 28  Edu_Graduation       2240 non-null   uint8
 29  Edu_Master           2240 non-null   uint8
 30  Edu_PhD              2240 non-null   uint8
 31  Marital_Absurd       2240 non-null   uint8
 32  Marital_Divorced     2240 non-null   uint8
 33  Marital_Married      2240 non-null   uint8
 34  Marital_Single       2240 non-null   uint8
 35  Marital_Together     2240 non-null   uint8
 36  Marital_Widow        2240 non-null   uint8
 37  Marital_YOLO         2240 non-null   uint8
dtypes: float64(3), int64(22), object(1), uint8(12)
memory usage: 563.3+ KB

Готово!